Product/www/app/Models/AssignmentModel.php

SELECT *
FROM `assignments`
WHERE `classID` = '0'
SELECT *
FROM `assignments`
WHERE `classID` = '0'
AND `topic` = 'Topic 01'
AND `assignmentName` = 'Assignment 01'
AND `userID` = 3
ORDER BY `updated_at` DESC
 LIMIT 1
---
    public function assignmentConfiguration($userID, $userType, $classID)
    {
        // array of assignmentIDs for the class
        $assignments = $this->where('classID', $classID)->findAll();

        // array of topicNames (concatenate topic and name) of assignments
        $topicNames = [];
        foreach ($assignments as $assignment) {
            $topicNames[] = ['topic' => $assignment['topic'], 'assignmentName' => $assignment['assignmentName']];
        }

        // remove duplicate in the multi-dimentional array
        $topicNames = array_map("unserialize", array_unique(array_map("serialize", $topicNames)));

        // for student
        if ($userType == 'student')
        {
            $ownedAssignments = [];

            // check if there is any assignment owned by the student for each topicName
            // always select the latest updated one if multiple records are found
            foreach ($topicNames as $topicName) {
                $owned = $this->where('classID', $classID)
                    ->where('topic', $topicName['topic'])
                    ->where('assignmentName', $topicName['assignmentName'])
                    ->where('userID', $userID)->orderBy('updated_at', 'desc')
                    ->first();

SELECT *
FROM `assignments`
WHERE `classID` = '0'
AND `topic` = 'Topic 04'
AND `assignmentName` = 'Assignment 06'
AND `userID` != 3
ORDER BY `updated_at` DESC
 LIMIT 1
---
                // (in future section, it is set that if student clicked into assignment that is not owned by himself/herself,
                //  there will be a copy of the assingment created, which will be owned by the student)
                else {
                    $ownedAssignments[] = $this->where('classID', $classID)
                        ->where('topic', $topicName['topic'])
                        ->where('assignmentName', $topicName['assignmentName'])
                        ->where('userID !=', $userID)
                        ->orderBy('updated_at', 'desc')
                        ->first();

SELECT *
FROM `assignments`
WHERE `classID` = '0'
AND `topic` = 'Topic 01'
AND `assignmentName` = 'Assignment 01'
AND `userID` != 20
ORDER BY `updated_at` DESC
---
            // (not owned --> not updated by student)
            // aways select the latest updated one if multiple records are found
            foreach ($topicNames as $topicName) {
                $owned = $this->where('classID', $classID)
                    ->where('topic', $topicName['topic'])
                    ->where('assignmentName', $topicName['assignmentName'])
                    ->where('userID !=', $userID)
                    ->orderBy('updated_at', 'desc')
                    ->findAll();

SELECT *
FROM `assignments`
WHERE `classID` = '0'
AND `topic` = 'Topic 01'
AND `assignmentName` = 'Assignment 01'
AND `userID` = 20
ORDER BY `updated_at` DESC
 LIMIT 1
---
                    $studentAssignments[$topicName['topic']."/".$topicName['assignmentName']] = $owned;
                }
                // if assignments are not owned by students, it is owned by teacher, so the userID will be equal to $id
                $notOwneds[] = $this->where('classID', $classID)
                    ->where('topic', $topicName['topic'])
                    ->where('assignmentName', $topicName['assignmentName'])
                    ->where('userID', $userID)
                    ->orderBy('updated_at', 'desc')
                    ->first();

SELECT *
FROM `assignments`
WHERE `assignments`.`assignmentID` = '391'
SELECT *
FROM `assignments`
WHERE `topic` = 'Topic 01'
AND `assignmentName` = 'Assignment 01'
AND `userID` != 20
---
    public function studentAssignmentConfiguration($assignmentID, $userID)
    {
        // find topics and assignment name according to assignmentID
        $assignment = $this->find($assignmentID);
        $topic = $assignment['topic'];
        $assignmentName = $assignment['assignmentName'];

        // find students' assignments with the same topic and assignment name (i.e., $assignments['userID'] != $userID of the teacher)
        $assignments = $this->where('topic', $topic)->where('assignmentName', $assignmentName)->where('userID !=', $userID)->findAll();

SELECT *
FROM `assignments`
WHERE `assignments`.`assignmentID` = '391'
---
    public function findClassID($assignmentID)
    {
        if ($assignmentID == null)
        {
            return null;
        }
        $classID = $this->find($assignmentID)['classID'];

SELECT *
FROM `assignments`
WHERE `assignments`.`assignmentID` = '391'
---
    public function checkNewAssignment($assignmentID, $userID)
    {
        $assignment = $this->find($assignmentID);

UPDATE `assignments` SET `studentProgress` = 100, `teacherProgress` = 100, `updated_at` = '2024-03-05 12:01:46'
WHERE `assignmentID` = '391'
---
    public function updateAssignmentProgress($assignmentID, $studentProgress, $teacherProgress)
    {
        $this->where('assignmentID', $assignmentID)
            ->set(['studentProgress' => $studentProgress])
            ->set(['teacherProgress' => $teacherProgress])
            ->set(['updated_at' => date('Y-m-d H:i:s')])
            ->update();

SELECT *
FROM `assignments`
WHERE `classID` = '0'
---
    public function findClassMeanPerformanceScore($classID)
    {
        // get all assigments in the class
        $assignments = $this->where('classID', $classID)->findAll();

SELECT *
FROM `assignments`
WHERE `classID` = '0'
---
    public function findAllClassesMeanPerformaceScore($classIDs)
    {
        $totalMark = 0;
        $maxMark = 0;
        foreach ($classIDs as $classID) {
            // get all assigments in all class
            $assignments = $this->where('classID', $classID)->findAll();