Product/www/app/Models/ClassModel.php

    public function classroomConfiguration_1($classIDs)
    {
        // find classes according to classID
        $classes = $this->find($classIDs);
---
SELECT *
FROM `classes`
WHERE `classes`.`classID` IN ('0','3','10','11','12','13')

    public function getClassNames($classIDs)
    {
        $classes = $this->find($classIDs);
---
SELECT *
FROM `classes`
WHERE `classes`.`classID` IN (0,3,10,11,12,13)

    public function getClassDetails($classIDs)
    {
        $classes = $this->find($classIDs);
---
SELECT *
FROM `classes`
WHERE `classes`.`classID` IN ('0','3','10','11','12','13')