Product/www/app/Models/QuestionModel.php

    public function questionConfiguration($assignmentID)
    {
        // array of questions belong to the class
        $questions = $this->where('assignmentID', $assignmentID)->orderBy('created_at', 'asc')->findAll();
---
SELECT *
FROM `questions`
WHERE `assignmentID` = '391'
ORDER BY `created_at` ASC

    public function updateQuestion($questionID, $question, $answer, $markingScheme, $comment, $totalMark, $maxMark)
    {
        // to avoid '' being updated as 0, so teachProgress can be calculated correctly
        if ($totalMark == '') {
            $totalMark = NULL;
        }
        if ($maxMark == '') {
            $maxMark = NULL;
        }
        return $this->update($questionID, [
            'question' => $question,
            'answer' => $answer,
            'markingScheme' => $markingScheme,
            'comment' => $comment,
            'totalMark' => $totalMark,
            'maxMark' => $maxMark,
            'updated_at' => date('Y-m-d H:i:s'),
        ]);
---
UPDATE `questions` SET `question` = 'Explain market', `answer` = 'A market is defined as the sum total of all the buyers and sellers in the area or region under consideration. The area may be the earth, or countries, regions, states, or cities.', `markingScheme` = 'A market is a place where parties can gather to facilitate the exchange of goods and services. The parties involved are usually buyers and sellers. The market may be physical, like a retail outlet, where people meet face-to-face, or virtual, like an online market, where there is no physical presence or contact between buyers and sellers.', `comment` = 'Didn\'t mention the forms of market', `totalMark` = '3', `maxMark` = '6', `updated_at` = '2024-03-05 12:01:46'
WHERE `questions`.`questionID` IN ('427')

    public function findAssignmentStudentProgress($assignmentID)
    {
        $questions = $this->where('assignmentID', $assignmentID)->findAll();
---
SELECT *
FROM `questions`
WHERE `assignmentID` = '391'

    public function findAssignmentTeacherProgress($assignmentID)
    {
        $questions = $this->where('assignmentID', $assignmentID)->findAll();
---
SELECT *
FROM `questions`
WHERE `assignmentID` = '391'