Product/www/app/Models/TagModel.php

    public function tagConfiguration($loadQuestions)
    {
        // array of tags belong to the assignment index by questionID
        $tagss = [];
        foreach ($loadQuestions as $loadQuestion) {
            $tagss[$loadQuestion['questionID']] = $this->where('questionID', $loadQuestion['questionID'])
                                                        ->orderBy('created_at', 'asc')->findAll();
---
SELECT *
FROM `tags`
WHERE `questionID` = '351'
ORDER BY `created_at` ASC

    public function sidebarConfiguration($assignmentIDs, $userType, $userID)
    {
        // if teacher
        if ($userType == 'teacher') {
            // array of tags belong to the assignment index by assignmentID
            $tagss = [];
            foreach ($assignmentIDs as $assignmentID) {
                $tagss[$assignmentID] = $this->where('assignmentID', $assignmentID)
                                                // tags created by students will not be shown
                                                ->where('userID', $userID)
                                                ->orderBy('created_at', 'asc')->findAll();
            }
        }
        else {
            // array of tags belong to the assignment index by assignmentID
            $tagss = [];
            foreach ($assignmentIDs as $assignmentID) {
                $tagss[$assignmentID] = $this->where('assignmentID', $assignmentID)
                                                ->orderBy('created_at', 'asc')->findAll();
---
SELECT *
FROM `tags`
WHERE `assignmentID` = '391'
ORDER BY `created_at` ASC

    public function deleteTag($tagID)
    {
        return $this->delete($tagID);
---
DELETE FROM `tags`
WHERE `tagID` IN ('332')