Product/www/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `users`.`id` = 3
---
    public function userConfiguration($id)
    {
        //find user record
        $user = $this->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '20'
---
    public function findUsername($ids)
    {
        //find username by id
        $usernames = [];
        foreach ($ids as $id) {
            $usernames[] = $this->find($id)['username'];

SELECT *
FROM `users`
WHERE `users`.`id` = 3
---
    public function findUsernames_attachedToIds($ids)
    {
        //find username by id
        $usernames = [];
        foreach ($ids as $id) {
            $usernames[] = $this->find($id)['username'];